w8d1/RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @post = Post.find_by(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (3) LIMIT $1  [["LIMIT", 1]]