w8d1/RedditClone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
     @sub.owner_id = current_user.id



    if @sub.save
---
INSERT INTO "subs" ("title", "description", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "reddit sub"], ["description", "cool"], ["owner_id", 1], ["created_at", "2021-03-08 20:10:56.849186"], ["updated_at", "2021-03-08 20:10:56.849186"]]