w6d3/FirstRoutes/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find_by(id: params[:id])

    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", ":("], ["updated_at", "2021-02-25 23:13:45.632980"], ["id", 3]]

  def destroy
    artwork = Artwork.find_by(id: params[:id])
    artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]