w6d3/FirstRoutes/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "dragon@email.com"], ["updated_at", "2021-02-25 00:28:19.602362"], ["id", 2]]