w7d2/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save #tried to save the user in the sessions if. would that matter?