w10d4/todo_redux/TodosApp/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "wash reptile"], ["body", "using snake oil"], ["done", false], ["created_at", "2021-03-29 23:40:30.244470"], ["updated_at", "2021-03-29 23:40:30.244470"]]
---
  def create
    todo = Todo.new(todo_params)
    if todo.save