w6d5/NinetyNineCats/NinetyNineCats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @catt = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @catt = Cat.find(params[:id])